ArmstrongSubero/PIC32-Projects/23_TTS.X/sam.c
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include "PIC32MX270_STD.h"
#include "sam.h"
#include "reciter.h"
#include "SamTabs.h"
#include "delay.h"
#include "uart1.h"
#include "ctype.h"

char input[256]; 

//standard sam sound
unsigned char speed = SAM_DEFAULT_SPEED;
unsigned char pitch = SAM_DEFAULT_PITCH;
unsigned char mouth = SAM_DEFAULT_MOUTH;
unsigned char throat = SAM_DEFAULT_THROAT;
_INT32_ singmode = 0;

// contains the final sound buffer
_INT32_ scale=50;

unsigned char wait1 = 7;
unsigned char wait2 = 6;

unsigned char mem39;
unsigned char mem44;
unsigned char mem47;
unsigned char mem49;
unsigned char mem50;
unsigned char mem51;
unsigned char mem53;
unsigned char mem56;

unsigned char mem59=0;

unsigned char A, X, Y;

unsigned char stress[256]; //numbers from 0 to 8
unsigned char phonemeLength[256]; 
unsigned char phonemeindex[256];


unsigned char phonemeIndexOutput[60]; 
unsigned char stressOutput[60]; 
unsigned char phonemeLengthOutput[60]; 

unsigned char tab44800[256];

unsigned char pitches[256]; // tab43008

unsigned char frequency1[256];
unsigned char frequency2[256];
unsigned char frequency3[256];

unsigned char amplitude1[256];
unsigned char amplitude2[256];
unsigned char amplitude3[256];

//timetable for more accurate c64 simulation
unsigned oldtimetableindex = 0;

void SetInput(char *_input)
{
	_INT32_ i, l;
	l = strlen(_input);
	if (l > 254) l = 254;
	for(i=0; i<l; i++)
		input[i] = _input[i];
	input[l] = 0;
}

void SetSpeed(unsigned char _speed) {speed=_speed;};
void SetPitch(unsigned char _pitch) {pitch=_pitch;};
void SetMouth(unsigned char _mouth) {mouth=_mouth;};
void SetThroat(unsigned char _throat) {throat=_throat;};

void Init();
_INT32_ Parser1();
void Parser2();
_INT32_ Code39771();
void Code41883();
void SetPhonemeLength();
void Code48619();
void Code41240();
void Insert(unsigned char position, unsigned char mem60, unsigned char mem59, unsigned char mem58);
void Code48431();
void Code47574();
void Code48547();
void Code48227();
void SetMouthThroat(unsigned char mouth, unsigned char throat);



// 168=pitches 
// 169=frequency1
// 170=frequency2
// 171=frequency3
// 172=amplitude1
// 173=amplitude2
// 174=amplitude3

void EnableSingMode(_UINT32_ sing) 
{
	singmode = sing;
}

void Init()
{
	_INT32_ i;
	SetMouthThroat( mouth, throat);

	// 1 second of output only, enough to pronounce 1 word on a PIC
	// using malloc or printf required usage of a heap size (Project > Build Options > Project > MPLAB LINK30 and set heap size)
	// See: Error: A heap is required, but has not been specified. http://www.microchip.com/forums/m737701.aspx

	for(i=0; i<256; i++)
	{
		pitches[i] = 0;
		amplitude1[i] = 0;
		amplitude2[i] = 0;
		amplitude3[i] = 0;
		frequency1[i] = 0;
		frequency2[i] = 0;
		frequency3[i] = 0;
		stress[i] = 0;
		phonemeLength[i] = 0;
		tab44800[i] = 0;
	}

	for(i=0; i<60; i++)
	{
		phonemeIndexOutput[i] = 0;
		stressOutput[i] = 0;
		phonemeLengthOutput[i] = 0;
	}
	phonemeindex[255] = 255; //to prevent buffer overflow // ML : changed from 32 to 255 to stop freezing with long inputs

}

void PlaySound(unsigned char b)
{
	// play via PWM
	OC1RS = b;
	delay_us(18);
}

//written by me because of different table positions.
// mem[47] = ...
// 168=pitches
// 169=frequency1
// 170=frequency2
// 171=frequency3
// 172=amplitude1
// 173=amplitude2
// 174=amplitude3
unsigned char Read(unsigned char p, unsigned char Y)
{
	switch(p)
	{
	case 168: return pitches[Y];
	case 169: return frequency1[Y];
	case 170: return frequency2[Y];
	case 171: return frequency3[Y];
	case 172: return amplitude1[Y];
	case 173: return amplitude2[Y];
	case 174: return amplitude3[Y];
	}
	return 0;
}

void Write(unsigned char p, unsigned char Y, unsigned char value)
{

	switch(p)
	{
	case 168: pitches[Y] = value; return;
	case 169: frequency1[Y] = value;  return;
	case 170: frequency2[Y] = value;  return;
	case 171: frequency3[Y] = value;  return;
	case 172: amplitude1[Y] = value;  return;
	case 173: amplitude2[Y] = value;  return;
	case 174: amplitude3[Y] = value;  return;
	}

}

_INT32_ SpeakInput()
{
	Init();
	phonemeindex[255] = 32; //to prevent buffer overflow

	if (!Parser1()) return 0;
	Parser2();
	Code41883();
	SetPhonemeLength();
	Code48619();
	Code41240();
	do
	{
		A = phonemeindex[X];
		if (A > 80)
		{
			phonemeindex[X] = 255;
			break; // error: delete all behind it
		}
		X++;
	} while (X != 0);

	Code48431();
	Code48547();

	// set PWM output to 0 so that a LED at the PWM position can be used to indicate speaking activity
	OC1RS = 0;

	return 1;

}


//seems to delete all zeros in table phoneme and copies it and 2 other tables
void Code48547()
{
	A = 0;
	X = 0;
	Y = 0;

	//pos48551:
	while(1)
	{
		A = phonemeindex[X];
		if (A == 255)
		{
			A = 255;
			phonemeIndexOutput[Y] = 255;
			Code47574();
			return;
		}
		if (A == 254)
		{
			X++;
			_INT32_ temp = X;
			//mem[48546] = X;
			phonemeIndexOutput[Y] = 255;
			Code47574();
			//X = mem[48546];
			X=temp;
			Y = 0;
			continue;
		}

		if (A == 0)
		{
			X++;
			continue;
		}

		phonemeIndexOutput[Y] = A;
		phonemeLengthOutput[Y] = phonemeLength[X];
		stressOutput[Y] = stress[X];
		X++;
		Y++;
	}

}

void Code48431()
{
	unsigned char mem54;
	unsigned char mem55;
	unsigned char index; //variable Y
	mem54 = 255;
	X++;
	mem55 = 0;
	unsigned char mem66 = 0;
	while(1)
	{
		//pos48440:
		X = mem66;
		index = phonemeindex[X];
		if (index == 255) return;
		mem55 += phonemeLength[X];

		if (mem55 < 232)
		{
			if (index != 254) // ML : Prevents an index out of bounds problem		
			{
				A = flags2[index]&1;
				if(A != 0)
				{
					X++;
					mem55 = 0;
					Insert(X, 254, mem59, 0);
					mem66++;
					mem66++;
					continue;
				}
			}
			if (index == 0) mem54 = X;
			mem66++;
			continue;
		}
		X = mem54;
		phonemeindex[X] = 31;   // 'Q'
		phonemeLength[X] = 4;
		stress[X] = 0;
		X++;
		mem55 = 0;
		Insert(X, 254, mem59, 0);
		X++;
		mem66 = X;
	}

