ArmstrongSubero/PIC32-Projects/23_TTS.X/sam.c
}


//add 1 to stress under some circumstances
void Code41883()
{
	unsigned char pos=0; //mem66
	while(1)
	{
		Y = phonemeindex[pos];
		if (Y == 255) return;
		if ((flags[Y] & 64) == 0) {pos++; continue;}
		Y = phonemeindex[pos+1];
		if (Y == 255) //prevent buffer overflow
		{
			if ((65 & 128) == 0)  {pos++; continue;}
		} else
			if ((flags[Y] & 128) == 0)  {pos++; continue;}

			Y = stress[pos+1];
			if (Y == 0)  {pos++; continue;}
			if ((Y & 128) != 0)  {pos++; continue;}
			stress[pos] = Y+1;
			pos++;
	}

}


//void Code41014()
void Insert(unsigned char position/*var57*/, unsigned char mem60, unsigned char mem59, unsigned char mem58)
{
	_INT32_ i;
	for(i=253; i >= position; i--) // ML : always keep last safe-guarding 255	
	{
		phonemeindex[i+1] = phonemeindex[i];
		phonemeLength[i+1] = phonemeLength[i];
		stress[i+1] = stress[i];
	}

	phonemeindex[position] = mem60;
	phonemeLength[position] = mem59;
	stress[position] = mem58;
	return;
}


_INT32_ Parser1()
{
	_INT32_ i;
	unsigned char sign1;
	unsigned char sign2;
	unsigned char position=0;
	X = 0;
	A = 0;
	Y = 0;
	for(i=0; i<256; i++)
		stress[i] = 0;

	while(1)
	{
		//pos41078:
		sign1 = input[X];
		if (sign1 == 155)
		{
			phonemeindex[position] = 255;      //mark endpoint
			return 1;       //all ok
		}
		X++;
		sign2 = input[X];

		Y = 0;
pos41095:
		A = signInputTable1[Y];
		if (A == sign1)
		{
			A = signInputTable2[Y];
			if ((A != '*') && (A == sign2))
			{
				phonemeindex[position] = Y;
				position++;
				X++;
				continue;
			}
		}
		Y++;
		if (Y != 81) goto pos41095;

		Y = 0;
pos41134:

		if (signInputTable2[Y] == '*')
		{
			if (signInputTable1[Y] == sign1)
			{
				phonemeindex[position] = Y;
				position++;
				continue;
			}
		}
		Y++;
		if (Y != 81) goto pos41134; //81 is size of table


		Y = 8;
		while( (sign1 != stressInputTable[Y]) && (Y>0))
		{
			Y--;
		}

		if (Y == 0)
		{
			//mem[39444] = X;
			//41181: JSR 42043 //Error
			return 0;
		}

		stress[position-1] = Y;
	} //while


}

//change phonemelength depedendent on stress
//void Code41203()
void SetPhonemeLength()
{
	unsigned char A;
	_INT32_ position = 0;
	while(phonemeindex[position] != 255 )
	{
		A = stress[position];
		//41218: BMI 41229
		if ((A == 0) || ((A&128) != 0))
		{
			phonemeLength[position] = phonemeLengthTable1[phonemeindex[position]];
		} else
		{
			phonemeLength[position] = phonemeLengthTable2[phonemeindex[position]];
		}
		position++;
	}
}


void Code41240()
{
	unsigned char pos=0;

	while(phonemeindex[pos] != 255)
	{
		unsigned char index; //register AC
		X = pos;
		index = phonemeindex[pos];
		if ((flags[index]&2) == 0)
		{
			pos++;
			continue;
		} else
			if ((flags[index]&1) == 0)
			{
				Insert(pos+1, index+1, phonemeLengthTable1[index+1], stress[pos]);
				Insert(pos+2, index+2, phonemeLengthTable1[index+2], stress[pos]);
				pos += 3;
				continue;
			}

			do
			{
				X++;
				A = phonemeindex[X];
			} while(A==0);

			if (A != 255)
			{
				if ((flags[A] & 8) != 0)  {pos++; continue;}
				if ((A == 36) || (A == 37)) {pos++; continue;} // '/H' '/X'
			}

			Insert(pos+1, index+1, phonemeLengthTable1[index+1], stress[pos]);
			Insert(pos+2, index+2, phonemeLengthTable1[index+2], stress[pos]);
			pos += 3;
	};

}

//void Code41397()
void Parser2()
{
	unsigned char pos = 0; //mem66;
	unsigned char mem58 = 0;

	while(1)
	{
		X = pos;
		A = phonemeindex[pos];

		if (A == 0)
		{
			pos++;
			continue;
		}
		if (A == 255) return;

		Y = A;

		if ((flags[A] & 16) == 0) goto pos41457;
		mem58 = stress[pos];
		A = flags[Y] & 32;
		if (A == 0) A = 20; else A = 21;    // 'WX' = 20 'YX' = 21
		//pos41443:
		Insert(pos+1, A, mem59, mem58);
		X = pos;
		goto pos41749;

pos41457:
		A = phonemeindex[X];
		if (A != 78) goto pos41487;  // 'UL'
		A = 24;         // 'L'                 //change 'UL' to 'AX L'
pos41466:
		mem58 = stress[X];
		phonemeindex[X] = 13;  // 'AX'
		Insert(X+1, A, mem59, mem58);
		pos++;
		continue;

pos41487:
		if (A != 79) goto pos41495;   // 'UM'
		A = 27; // 'M'  //changle 'UM' to  'AX M'
		goto pos41466;
pos41495:
		if (A != 80) goto pos41503; // 'UN'
		A = 28;         // 'N' //change UN to 'AX N'
		goto pos41466;
pos41503:
		Y = A;
		A = flags[A] & 128;

		if (A != 0)
		{
			A = stress[X];
			if (A != 0)
			{
				X++;
				A = phonemeindex[X];
				if (A == 0)
				{
					X++;
					Y = phonemeindex[X];
					if (Y == 255) //buffer overflow
						A = 65&128;
					else
						A = flags[Y] & 128;

					if (A != 0)
					{
						A = stress[X];
						if (A != 0)
						{
							// 31 = 'Q'
							Insert(X, 31, mem59, 0);
							pos++;
							continue;
						}
					}
				}
			}
		}


		X = pos;
		A = phonemeindex[pos];
		if (A != 23) goto pos41611;     // 'R'
		X--;
		A = phonemeindex[pos-1];
		//pos41567:
		if (A == 69)                    // 'T'
		{
			phonemeindex[pos-1] = 42;
			goto pos41779;
		}

		if (A == 57)                    // 'D'
		{
			phonemeindex[pos-1] = 44;
			goto pos41788;
		}

		A = flags[A] & 128;
		if (A != 0) phonemeindex[pos] = 18;  // 'RX'
		pos++;
		continue;

pos41611:
		if (A == 24)    // 'L'
		{
			if ((flags[phonemeindex[pos-1]] & 128) == 0) {pos++; continue;}
			phonemeindex[X] = 19;     // 'LX'
			pos++;
			continue;
		}

		if (A == 32)    // 'S'
		{
			if (phonemeindex[pos-1] != 60) {pos++; continue;}
			phonemeindex[pos] = 38;    // 'Z'
			pos++;
			continue;
		}

		if (A == 72)    // 'K'
		{
			Y = phonemeindex[pos+1];
			if (Y == 255) phonemeindex[pos] = 75; // ML : prevents an index out of bounds problem		
			else
			{
				A = flags[Y] & 32;
				if (A == 0) phonemeindex[pos] = 75;  // 'KX'
			}
		}
		else
			if (A == 60)   // 'G'
			{
				unsigned char index = phonemeindex[pos+1];
				if (index == 255)
				{
					if ((65 & 32) != 0) {pos++; continue;}//prevent buffer overflow
				}
				else
					if ((flags[index] & 32) != 0) {pos++; continue;}
					phonemeindex[pos] = 63; // 'GX'
					pos++;
					continue;
			}
			Y = phonemeindex[pos];
			//pos41719:
			A = flags[Y] & 1;
			if (A == 0) goto pos41749;
			A = phonemeindex[pos-1];
			if (A != 32)    // 'S'
			{
				A = Y;
				goto pos41812;
			}
			phonemeindex[pos] = Y-12;
			pos++;
			continue;



pos41749:
			A = phonemeindex[X];
			if (A == 53)    // 'UW'
			{
				Y = phonemeindex[X-1];
				A = flags2[Y] & 4;
				if (A == 0) {pos++; continue;}
				phonemeindex[X] = 16;
				pos++;
				continue;
			}
pos41779:

