ArmstrongSubero/PIC32-Projects/23_TTS.X/sam.c
			if (A == 42)    // 'CH'
			{
				//        pos41783:
				Insert(X+1, A+1, mem59, stress[X]);
				pos++;
				continue;
			}

pos41788:
			if (A == 44) // 'J'
			{
				Insert(X+1, A+1, mem59, stress[X]);
				pos++;
				continue;
			}
pos41812:
			if (A != 69)    // 'T'
				if (A != 57) {pos++; continue;}       // 'D'
				//pos41825:

				if ((flags[phonemeindex[X-1]] & 128) == 0) {pos++; continue;}
				X++;
				A = phonemeindex[X];
				//pos41841
				if (A != 0)
				{
					if ((flags[A] & 128) == 0) {pos++; continue;}
					if (stress[X] != 0) {pos++; continue;}
					//pos41856:
					phonemeindex[pos] = 30;       // 'DX'
				} else
				{
					A = phonemeindex[X+1];
					if (A == 255) //prevent buffer overflow
						A = 65 & 128;
					else
						A = flags[A] & 128;

					if (A != 0) phonemeindex[pos] = 30;  // 'DX'
				}

				pos++;

	} // while


}

//change phoneme length
void Code48619()
{
	X = 0;
	unsigned char index;

	unsigned char mem66=0;
	while(1)
	{
		index = phonemeindex[X];
		if (index == 255) break;
		if((flags2[index] & 1) == 0)
		{
			X++;
			continue;
		}
		mem66 = X;
pos48644:
		X--;
		if(X == 0) break;
		index = phonemeindex[X];

		if (index != 255) //inserted to prevent access overrun
			if((flags[index] & 128) == 0) goto pos48644;

		//pos48657:
		do
		{
			index = phonemeindex[X];
			if (index != 255)//inserted to prevent access overrun
				if(((flags2[index] & 32) == 0) || ((flags[index] & 4) != 0))     //nochmal überprüfen
				{
					//A = flags[Y] & 4;
					//if(A == 0) goto pos48688;
					A = phonemeLength[X];
					A = (A >> 1) + A + 1;   // 3/2*A+1 ???
					phonemeLength[X] = A;
				}

				X++;
		} while (X != mem66);
		//	if (X != mem66) goto pos48657;

		X++;
	}  // while

	mem66 = 0;
	//pos48697

	while(1)
	{
		X = mem66;
		index = phonemeindex[X];
		if (index == 255) return;
		A = flags[index] & 128;
		if (A != 0)
		{

			X++;
			index = phonemeindex[X];
			if (index == 255) 
				mem56 = 65;
			else
				mem56 = flags[index];

			if ((flags[index] & 64) == 0)
			{
				if ((index == 18) || (index == 19))  // 'RX' & 'LX'
				{
					X++;
					index = phonemeindex[X];
					if ((flags[index] & 64) != 0)
						phonemeLength[mem66]--;
					mem66++;
					continue;
				}
				mem66++;
				continue;
			}

			if ((mem56 & 4) == 0)
			{
				if((mem56 & 1) == 0) {mem66++; continue;}
				X--;
				mem56 = phonemeLength[X] >> 3;
				phonemeLength[X] -= mem56;
				mem66++;
				continue;
			}
			A = phonemeLength[X-1];
			phonemeLength[X-1] = (A >> 2) + A + 1;     // 5/4*A + 1
			mem66++;
			continue;

		}

		//pos48821:

		if((flags2[index] & 8) != 0)
		{
			X++;
			index = phonemeindex[X];
			if (index == 255) A = 65&2;  //prevent buffer overflow
			else
				A = flags[index] & 2;
			if(A != 0)
			{
				phonemeLength[X] = 6;
				phonemeLength[X-1] = 5;
			}
			mem66++;
			continue;

		}


		if((flags[index] & 2) != 0)
		{
			do
			{
				X++;
				index = phonemeindex[X];
			} while(index == 0);
			if (index == 255) //buffer overflow
			{
				if ((65 & 2) == 0) {mem66++; continue;}
			} else
				if ((flags[index] & 2) == 0) {mem66++; continue;}

				phonemeLength[X] = (phonemeLength[X] >> 1) + 1;
				X = mem66;
				phonemeLength[mem66] = (phonemeLength[mem66] >> 1) + 1;
				mem66++;
				continue;
		}


		if ((flags2[index] & 16) != 0)
		{
			index = phonemeindex[X-1];
			if((flags[index] & 2) != 0) phonemeLength[X] -= 2;
		}

		mem66++;
		continue;
	}


	//	goto pos48701;
}

// -------------------------------------------------------------------------
// ML : Code47503 is division with remainder, and mem50 gets the sign
void Code47503(unsigned char mem52)
{

	Y = 0;
	if ((mem53 & 128) != 0)
	{
		mem53 = -mem53;
		Y = 128;
	}
	mem50 = Y;
	A = 0;
	for(X=8; X > 0; X--)
	{
		_INT32_ temp = mem53;
		mem53 = mem53 << 1;
		A = A << 1;
		if (temp >= 128) A++;
		if (A >= mem52)
		{
			A = A - mem52;
			mem53++;
		}
	}

	mem51 = A;
	if ((mem50 & 128) != 0) mem53 = -mem53;

}

// -------------------------------------------------------------------------


void Code48227(unsigned char *mem66)
{
	_INT32_ k;	
	_INT32_ tempA;
	_INT32_ i;
	mem49 = Y;
	A = mem39&7;
	X = A-1;
	mem56 = X;
	mem53 = tab48426[X];
	mem47 = X;      //46016+mem[56]*256
	A = mem39 & 248;
	if(A == 0)
	{
		Y = mem49;
		A = pitches[mem49] >> 4;
		goto pos48315;
	}
	Y = A ^ 255;
pos48274:
	mem56 = 8;
	A = randomtable[mem47*256+Y];
pos48280:

	tempA = A;
	A = A << 1;
	//48281: BCC 48290
	if ((tempA & 128) == 0)
	{
		X = mem53;
		//timetable 1
		oldtimetableindex = 1;

		for(k=0; k<5; k++)
		{
			PlaySound((X & 15)*16);
		}

		if(X != 0) goto pos48296;
	}
	//timetable 2;
	oldtimetableindex = 2;
	for(k=0; k<5; k++)
	{
		PlaySound((5 & 15)*16);
	}

	//48295: NOP
pos48296:

	for(i=0; i<wait1; i++) //wait
		X = 0;

	mem56--;
	if (mem56 != 0) goto pos48280;
	Y++;
	if (Y != 0) goto pos48274;
	mem44 = 1;
	Y = mem49;
	return;


	unsigned char phase1;

pos48315:
	// Error Error Error

	phase1 = A ^ 255;
	Y = *mem66;
	do
	{
		//pos48321:

		mem56 = 8;
		//A = Read(mem47, Y);
		A = randomtable[mem47*256+Y];     //???


		//pos48327:
		do
		{
			//48327: ASL A
			//48328: BCC 48337
			tempA = A;
			A = A << 1;
			if ((tempA & 128) != 0)
			{
				X = 26;
				//timetable 3
				oldtimetableindex = 3;
				for(k=0; k<5; k++)
				{
					PlaySound((X & 15)*16);
				}

			} else
			{
				//timetable 4
				X=6;
				oldtimetableindex = 4;
				for(k=0; k<5; k++)
				{
					PlaySound((X & 15)*16);
				}
			}

			for(X = wait2; X>0; X--); //wait
			mem56--;
		} while(mem56 != 0);

		Y++;
		phase1++;

	} while (phase1 != 0);
	//	if (phase1 != 0) goto pos48321;
	A = 1;
	mem44 = 1;
	*mem66 = Y;
	Y = mem49;
	return;
}

