ArmstrongSubero/PIC32-Projects/23_TTS.X/sam.c
void Special1(unsigned char mem48, unsigned char phase1)
{

	//pos48372:
	//	mem48 = 255;
	//pos48376:
	mem49 = X;
	A = X;
	_INT32_ Atemp = A;
	A = A - 30;
	if (Atemp <= 30) A=0; // ???
	X = A;

	// ML : A =, fixes a problem with invalid pitch with '.'
	while( (A=pitches[X]) == 127) X++;


pos48398:
	//48398: CLC
	//48399: ADC 48
	A += mem48;
	phase1 = A;
	pitches[X] = A;
pos48406:
	X++;
	if (X == mem49) return; //goto pos47615;
	if (pitches[X] == 255) goto pos48406;
	A = phase1;
	goto pos48398;
}


void Code47574()
{
	_INT32_ k;
	unsigned char phase1=0;  //mem43
	unsigned char phase2;
	unsigned char phase3;
	unsigned char mem66;
	unsigned char mem38;
	unsigned char mem40;
	unsigned char speedcounter; //mem45
	unsigned char mem48;
	_INT32_ i;
	_INT32_ carry;
	if (phonemeIndexOutput[0] == 255) return; //exit if no data

	A = 0;
	X = 0;
	mem44 = 0;
pos47587:
	Y = mem44;
	A = phonemeIndexOutput[mem44];
	mem56 = A;
	if (A == 255) goto pos47694;
	if (A == 1)
	{
		//pos48366:
		A = 1;
		mem48 = 1;
		//goto pos48376;
		Special1(mem48, phase1);
	}
	/*
	if (A == 2) goto pos48372;
	*/
	if (A == 2)
	{
		mem48 = 255;
		Special1(mem48, phase1);
	}
	//	pos47615:

	phase1 = tab47492[stressOutput[Y] + 1];
	phase2 = phonemeLengthOutput[Y];
	Y = mem56;
	do
	{
		frequency1[X] = freq1data[Y];
		frequency2[X] = freq2data[Y];
		frequency3[X] = freq3data[Y];
		amplitude1[X] = ampl1data[Y];
		amplitude2[X] = ampl2data[Y];
		amplitude3[X] = ampl3data[Y];
		tab44800[X] = tab45936[Y];
		pitches[X] = pitch + phase1;
		X++;
		phase2--;
	} while(phase2 != 0);
	mem44++;

	if(mem44 != 0) goto pos47587;

pos47694:

	A = 0;
	mem44 = 0;
	mem49 = 0;
	X = 0;
	while(1) //while No. 1
	{

		//pos47701:
		Y = phonemeIndexOutput[X];
		A = phonemeIndexOutput[X+1];
		X++;
		if (A == 255) break;//goto pos47970;
		X = A;
		mem56 = tab45856[A];
		A = tab45856[Y];
		if (A == mem56)
		{
			phase1 = tab45696[Y];
			phase2 = tab45696[X];
		} else
			if (A < mem56)
			{
				phase1 = tab45776[X];
				phase2 = tab45696[X];
			} else
			{
				phase1 = tab45696[Y];
				phase2 = tab45776[Y];
			}

			Y = mem44;
			A = mem49 + phonemeLengthOutput[mem44];
			mem49 = A;
			A = A + phase2; //Maybe Problem because of carry flag
			//47776: ADC 42
			speedcounter = A;
			mem47 = 168;
			phase3 = mem49 - phase1;
			A = phase1 + phase2;
			mem38 = A;
			X = A;
			X -= 2;
			//47805: BPL 47810
			if ((X & 128) == 0)
				do   //while No. 2
				{
					//pos47810:

					mem40 = mem38;
					if (mem47 == 168)     //for amplitude1
					{
						unsigned char mem36, mem37;
						mem36 = phonemeLengthOutput[mem44] >> 1;
						mem37 = phonemeLengthOutput[mem44+1] >> 1;
						mem40 = mem36 + mem37;
						mem37 += mem49;
						mem36 = mem49 - mem36;
						A = Read(mem47, mem37);
						//A = mem[address];
						Y = mem36;
						mem53 = A - Read(mem47, mem36);
					} else
					{
						A = Read(mem47, speedcounter);
						Y = phase3;
						mem53 = A - Read(mem47, phase3);
					}

					//Code47503(mem40);
					// ML : Code47503 is division with remainder, and mem50 gets the sign
					mem50 = (((char)(mem53) < 0) ? 128 : 0);
					mem51 = abs((char)mem53) % mem40;
					mem53 = (unsigned char)((char)(mem53) / mem40);

					X = mem40;
					Y = phase3;

					mem56 = 0;
					//47907: CLC
					//pos47908:
					while(1)     //while No. 3
					{
						A = Read(mem47, Y) + mem53; //carry alway cleared

						mem48 = A;
						Y++;
						X--;
						if(X == 0) break;

						mem56 += mem51;
						if (mem56 >= mem40)  //???
						{
							/*
							47927: CMP 40
							47927: BCC 47945
							*/
							//47931: SBC 40
							mem56 -= mem40; //carry? is set
							//if ((mem56 & 128)==0)
							if ((mem50 & 128)==0)
							{
								//47935: BIT 50
								//47937: BMI 47943
								if(mem48 != 0) mem48++;
							} else mem48--;
						}
						//pos47945:
						Write(mem47, Y, mem48);
						//47949: CLC
						//47950: BCC 47908

						//goto pos47908;

					} //while No. 3

					//pos47952:
					mem47++;
					//if (mem47 != 175) goto pos47810;
				} while (mem47 != 175);     //while No. 2
				//pos47963:
				mem44++;
				X = mem44;
	}  //while No. 1

	//goto pos47701;
	//pos47970:

	mem48 = mem49 + phonemeLengthOutput[mem44];
	if (!singmode)
	{
		for(i=0; i<256; i++)
			pitches[i] -= (frequency1[i] >> 1);
	}

	phase1 = 0;
	phase2 = 0;
	phase3 = 0;
	mem49 = 0;
	speedcounter = 72; //sam standard speed

	//amplitude rescaling
	for(i=255; i>=0; i--)
	{
		amplitude1[i] = amplitudeRescale[amplitude1[i]];
		amplitude2[i] = amplitudeRescale[amplitude2[i]];
		amplitude3[i] = amplitudeRescale[amplitude3[i]];
	}

	Y = 0;
	A = pitches[0];
	mem44 = A;
	X = A;
	mem38 = A - (A>>2);     // 3/4*A ???

	//finally the loop for sound output
	//pos48078:
	while(1)
	{
		A = tab44800[Y];
		mem39 = A;
		A = A & 248;
		if(A != 0)
		{
			Code48227(&mem66);
			Y += 2;
			mem48 -= 2;
		} else
		{
			mem56 = multtable[sinus[phase1] | amplitude1[Y]];

			carry = 0;
			if ((mem56+multtable[sinus[phase2] | amplitude2[Y]] ) > 255) carry = 1;
			mem56 += multtable[sinus[phase2] | amplitude2[Y]];
			A = mem56 + multtable[rectangle[phase3] | amplitude3[Y]] + (carry?1:0);
			A = ((A + 136) & 255) >> 4; //there must be also a carry

			//timetable 0
			oldtimetableindex = 0;

			for(k=0; k<5; k++)
			{
				PlaySound((A & 15)*16);
			}

			speedcounter--;
			if (speedcounter != 0) goto pos48155;
			Y++; //go to next amplitude
			mem48--;
		}
		if(mem48 == 0) return;
		speedcounter = speed;
pos48155:
		mem44--;
		if(mem44 == 0)
		{
pos48159:

			A = pitches[Y];
			mem44 = A;
			A = A - (A>>2);
			mem38 = A;
			phase1 = 0;
			phase2 = 0;
			phase3 = 0;
			continue;
		}
		mem38--;
		if((mem38 != 0) || (mem39 == 0))
		{
			phase1 += frequency1[Y];
			phase2 += frequency2[Y];
			phase3 += frequency3[Y];
			continue;
		}
		Code48227(&mem66);
		goto pos48159;
	} //while

	//--------------------------
	//pos48315:
	_INT32_ tempA;
	phase1 = A ^ 255;
	Y = mem66;
	do
	{
		//pos48321:

		mem56 = 8;
		A = Read(mem47, Y);

		//pos48327:
		do
		{
			//48327: ASL A
			//48328: BCC 48337
			tempA = A;
			A = A << 1;
			if ((tempA & 128) != 0)
			{
				X = 26;
				PlaySound((X & 15)*16);
			} else
			{
				X=6; 
				PlaySound((X & 15)*16);
			}

			for(X = wait2; X>0; X--); //wait
			mem56--;
		} while(mem56 != 0);

