ArmstrongSubero/PIC32-Projects/23_TTS.X/sam.c
		Y++;
		phase1++;

	} while (phase1 != 0);
	//	if (phase1 != 0) goto pos48321;
	A = 1;
	mem44 = 1;
	mem66 = Y;
	Y = mem49;
	return;
}

//return = (mem39212*mem39213) >> 1
unsigned char trans(unsigned char mem39212, unsigned char mem39213)
{
	//pos39008:
	unsigned char carry;
	_INT32_ temp;
	unsigned char mem39214, mem39215;
	A = 0;
	mem39215 = 0;
	mem39214 = 0;
	X = 8;
	do
	{
		carry = mem39212 & 1;
		mem39212 = mem39212 >> 1;
		if (carry != 0)
		{
			/*
			39018: LSR 39212
			39021: BCC 39033
			*/
			carry = 0;
			A = mem39215;
			temp = (_INT32_)A + (_INT32_)mem39213;
			A = A + mem39213;
			if (temp > 255) carry = 1;
			mem39215 = A;
		}
		temp = mem39215 & 1;
		mem39215 = (mem39215 >> 1) | (carry?128:0);
		carry = temp;
		//39033: ROR 39215
		X--;
	} while (X != 0);
	temp = mem39214 & 128;
	mem39214 = (mem39214 << 1) | (carry?1:0);
	carry = temp;
	temp = mem39215 & 128;
	mem39215 = (mem39215 << 1) | (carry?1:0);
	carry = temp;

	return mem39215;
}


/*
SAM's voice can be altered by changing the frequencies of the
mouth formant (F1) and the throat formant (F2). Only the voiced
phonemes (5-29 and 48-53) are altered.
*/
void SetMouthThroat(unsigned char mouth, unsigned char throat)
{
	unsigned char initialFrequency;
	unsigned char newFrequency = 0;
	//unsigned char mouth; //mem38880
	//unsigned char throat; //mem38881

	unsigned char pos = 5; //mem39216
	//pos38942:
	// recalculate formant frequencies 5..29 for the mouth (F1) and throat (F2)
	while(pos != 30)
	{
		// recalculate mouth frequency
		initialFrequency = mouthFormants5_29[pos];
		if (initialFrequency != 0) newFrequency = trans(mouth, initialFrequency);
		freq1data[pos] = newFrequency;

		// recalculate throat frequency
		initialFrequency = throatFormants5_29[pos];
		if(initialFrequency != 0) newFrequency = trans(throat, initialFrequency);
		freq2data[pos] = newFrequency;
		pos++;
	}

	//pos39059:
	// recalculate formant frequencies 48..53
	pos = 48;
	Y = 0;
	while(pos != 54)
	{
		// recalculate F1 (mouth formant)
		initialFrequency = mouthFormants48_53[Y];
		newFrequency = trans(mouth, initialFrequency);
		freq1data[pos] = newFrequency;

		// recalculate F2 (throat formant)
		initialFrequency = throatFormants48_53[Y];
		newFrequency = trans(throat, initialFrequency);
		freq2data[pos] = newFrequency;
		Y++;
		pos++;
	}
}

void processInput(char* input)
{
	unsigned char i;

	strcat(input, " ");
	for(i=0; input[i] != 0; i++)
		input[i] = toupper(input[i]);

	strcat(input, " \x9b\0");
}

_INT16_ speakText(const char* str)
{
	int i;
	/*
	int j;
	unsigned char isLastCharSpace = 0;
	unsigned char isLast2CharsSpace = 0;
	*/

	EnableSingMode(0);

	char input[255];



	// fill the initial string with space. There was a bug in TextToPhonemes function
	// which copies all the characters in the original buffer ignoring end of string marker
	// on a PC, this will likely be '0' so it's correct. However on a PIC this can be anything
	// so later the Phonemes will contain random character and text to speech will fail.
	for (i=strlen(input)+1; i<255; i++)
		input[i] = 32;

	strcpy(input, str);
	processInput(input);

	if (!TextToPhonemes(input))
	{
		// SendUARTStr("TextToPhonemes error.");
		LATBbits.LATB2 = 0;
		return 0;
	}
	else
	{
		// even with the above workaround, the converted Phonemes may still contain random
		// characters after the end
		// we temporarily fix it by checking for triple spaces in the Phonemes. If encountered
		// those, truncate the string there (the proper Phonemes should only contain single space)
		// this is commented out as sometimes there may be duplicate space in the output string
		/*
		for (i=0; i < 255; i++)	
		{
			if (input[i] == 32 && isLastCharSpace && isLast2CharsSpace)
				break;
			else if (input[i] == 32 && isLastCharSpace)
				isLast2CharsSpace = 1;
			else 
				isLastCharSpace = (input[i] == 32);
		}

		input[i] = 155;
		for (j=i+1; j < 255; j++)
		{
			input[j] = 0;
		}
		*/

		SetInput(input);

		// SendUARTStr(input);

		if (!SpeakInput())
		{
			
			return 0;
		}
		else
		{
			return 1;
		}
	}

}

unsigned char SingString(unsigned char pitch, const char* str)
{
	
	EnableSingMode(1);
	SetPitch(pitch);

	strcpy(input, str);
	processInput(input);
	SetInput(input);
	unsigned char ret = SpeakInput();

	EnableSingMode(0);
	SetPitch(SAM_DEFAULT_PITCH);

	return ret;
}
